app/controllers/k_controller.rb

INSERT INTO "entries" ("reading", "created_at", "updated_at", "expression", "definition", "status") VALUES(NULL, '2009-02-07 04:50:31', '2009-02-07 04:50:31', 'テスト', NULL, 1)
SELECT * FROM "entries" WHERE (status = 1)
---
  def e
    if params[:entry]
      entry = Entry.new(params[:entry])
      if params[:jdef]
        jdef = entry.get_j_def
        logger.debug ("Got #{jdef}")
        entry.definition = jdef if jdef
        logger.debug ("entry.definition = #{entry.definition}")
      end
      entry.save
      redirect_to :action => :e
    else
      @entries = Entry.find(:all, :conditions => ['status = ?', Entry::STATUS_ACTIVE], :order => 'created_at desc')